DataProcessors/ОбработкаСписанныхТоваровИзВозвратныхНакладных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>ОбработкаСписанныхТоваровИзВозвратныхНакладных</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ДокументыВозвратТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ДокументыВозвратТоваров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВозвратТовара</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗависимыйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КомплектацияНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийКомплектацияНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыОперацийКомплектацияНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Комплектация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разукомплектация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>(Общ) Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС14</Name>
					<Comment>(Общ) Ставка НДС 14%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>(Общ) Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНДС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/КомплектацияНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>КомплектацияНоменклатуры</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.СчетНаОплатуПокупателю</xr:Item>
				<xr:Item>Document.ВнутреннийЗаказ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыВРезервеНаСкладах</xr:Item>
				<xr:Item>InformationRegister.СписанныеТовары</xr:Item>
				<xr:Item>AccountingRegister.Налоговый</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРознице</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыОрганизаций</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.УдалитьПартииТоваровПереданныеНалоговыйУчет</xr:Item>
				<xr:Item>AccumulationRegister.ВнутренниеЗаказы</xr:Item>
				<xr:Item>AccumulationRegister.РеализованныеТовары</xr:Item>
				<xr:Item>AccumulationRegister.УдалитьПартииТоваровНаСкладахНалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВУправленческомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬОтражатьВНалоговомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийКомплектацияНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСуммаДокумента</Name>
					<Comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособСписанияОстаткаТоваров</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыСписанияОстаткаТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаБУ</Name>
					<Comment>(Регл) </Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬСтатьяПриростаУбылиЗапасов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиНалоговыхДеклараций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяПозиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеПозиции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладМатериалов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнУстановкаВремени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комплектующие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоляСтоимости</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособСписанияОстаткаТоваров</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыСписанияОстаткаТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСумма</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаБУ</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УДАЛИТЬСтатьяПриростаУбылиЗапасов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиНалоговыхДеклараций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатурнаяПозиция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеПозиции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ОбработкаСписанныхТоваровИзВозвратныхНакладных/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
#Область СлужебныйПрограммныйИнтерфейс

//Создает комплектации на основании входящих данных
//ДанныеНоменклатуры - Структура:
//ДокументСписания, Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Коэффициент, СчетУчетаБУ, Количество, Склад, Дата
Функция РазукомплектоватьТоварныеПозиции(ДанныеНоменклатуры) Экспорт
	
	МассивКомплектов = Новый Массив; //Хранит данные о разукомплектации номенклатуры. 
	
	ТаблицаНоменклатуры = Новый ТаблицаЗначений();
	ТаблицаНоменклатуры.Колонки.Добавить("ДокументСписания",  Новый ОписаниеТипов("ДокументСсылка.СписаниеТоваров"));
	ТаблицаНоменклатуры.Колонки.Добавить("ВозвратТовара",  Новый ОписаниеТипов("ДокументСсылка.ВозвратТоваровОтПокупателя"));
	ТаблицаНоменклатуры.Колонки.Добавить("Склад",  Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ТаблицаНоменклатуры.Колонки.Добавить("Дата",  Новый ОписаниеТипов("Дата"));
	ТаблицаНоменклатуры.Колонки.Добавить("Номенклатура",  Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаНоменклатуры.Колонки.Добавить("Количество",  Новый ОписаниеТипов("Число"));
	ТаблицаНоменклатуры.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения"));
	ТаблицаНоменклатуры.Колонки.Добавить("Коэффициент",  Новый ОписаниеТипов("Число"));
	ТаблицаНоменклатуры.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаНоменклатуры.Колонки.Добавить("СчетУчетаБУ", Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	
	Для Каждого СтруктураДанных Из ДанныеНоменклатуры Цикл
		НоваяСтрока = ТаблицаНоменклатуры.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураДанных);
	КонецЦикла;
	
	ТаблицаДокументов = ТаблицаНоменклатуры.Скопировать();
	ТаблицаДокументов.Свернуть("ДокументСписания");
	
	НачатьТранзакцию();
	
	Для Каждого СтрокаТаблицы Из ТаблицаДокументов Цикл
		
		Попытка
			ДокументСписания = СтрокаТаблицы.ДокументСписания.ПолучитьОбъект();
			ДокументСписания.Заблокировать();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение (Нстр(СтрЗаменить("ru = 'Операция создания документов не удалась. Не удалась блокировка документа %1 '; 
			|uk = 'Операция создания документов не удалась. Не вдалося блокувати документ %1'","%1", Строка(СтрокаТаблицы.ДокументСписания))));
		КонецПопытки;
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ТаблицаНоменклатуры.ДокументСписания,
		|	ТаблицаНоменклатуры.ВозвратТовара,
		|	ТаблицаНоменклатуры.Номенклатура,
		|	ТаблицаНоменклатуры.Количество,
		|	ТаблицаНоменклатуры.ЕдиницаИзмерения,
		|	ТаблицаНоменклатуры.Коэффициент,
		|	ТаблицаНоменклатуры.ХарактеристикаНоменклатуры,
		|	ТаблицаНоменклатуры.СчетУчетаБУ,
		|	ТаблицаНоменклатуры.Склад,
		|	ТаблицаНоменклатуры.Дата
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.ДокументСписания,
		|	ВТ.ВозвратТовара,
		|	ВТ.Номенклатура,
		|	ВТ.Количество,
		|	ВТ.ЕдиницаИзмерения,
		|	ВТ.Коэффициент,
		|	ВТ.ХарактеристикаНоменклатуры,
		|	ВТ.СчетУчетаБУ,
		|	ВТ.Склад,
		|	ВТ.Дата,
		|	Подразделения.Ссылка КАК Подразделение
		|ИЗ
		|	ВТ КАК ВТ,
		|	Справочник.Подразделения КАК Подразделения
		|ГДЕ
		|	ВТ.ДокументСписания = &ДокументСписания
		|	И Подразделения.Код = ""000000001""
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.ДокументСписания,
		|	ВТ.ВозвратТовара,
		|	ВТ.Номенклатура,
		|	ВТ.Количество,
		|	ВТ.ЕдиницаИзмерения,
		|	ВТ.Коэффициент,
		|	ВТ.ХарактеристикаНоменклатуры,
		|	ВТ.СчетУчетаБУ,
		|	ВТ.Склад,
		|	ВТ.Дата,
		|	Подразделения.Ссылка");
		
		Запрос.УстановитьПараметр("ДокументСписания", СтрокаТаблицы.ДокументСписания);
		Запрос.УстановитьПараметр("ТаблицаНоменклатуры", ТаблицаНоменклатуры);
	
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			//Создаем документ разукомплектация 
			Комплектация = Документы.КомплектацияНоменклатуры.СоздатьДокумент();
			// Заполнить реквизиты значениями по умолчанию.
			ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(Комплектация, глЗначениеПеременной("глТекущийПользователь"),,,,);
			ОбщегоНазначения.ЗаполнитьОбязательныеРеквизитыШапкиНовогоДокумента(Комплектация, глЗначениеПеременной("глТекущийПользователь"));
			
			Комплектация.ВидОперации = Перечисления.ВидыОперацийКомплектацияНоменклатуры.Разукомплектация;
			ЗаполнитьЗначенияСвойств(Комплектация,Выборка);
			 
			//Строки ТЧ 
			НоваяСтрока = Комплектация.Комплектующие.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка,,"ХарактеристикаНоменклатуры");
			НоваяСтрока.ДоляСтоимости = 1;
			Комплектация.ЗаполнитьСчетаУчетаВСтрокеТабЧасти(НоваяСтрока, "КомплектацияНоменклатуры" , Истина, Истина);
			Комплектация.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая;
			Комплектация.Комментарий = "##СозданИз_ОбработкаСписанныхТоваров##";

			//Запись
			Попытка
				Комплектация.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ОтменитьТранзакцию();
				ВызватьИсключение (Нстр("ru = 'Операция создания документов не удалась'; uk = 'Операция создания документов не удалась'"));
			КонецПопытки;
			
			//Удаляем строки из списания
			Товары = ДокументСписания.Товары;
			ПарамПоиска = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Коэффициент, Количество");
			ЗаполнитьЗначенияСвойств(ПарамПоиска, Выборка);
			
			Строки = Товары.НайтиСтроки(ПарамПоиска);
			
			Если Не Строки.Количество() = 0 Тогда
				Товары.Удалить(Строки[0]);
			КонецЕсли;
			
			
			ДанныеРазукомплектации = Новый Структура("Комплектация, ДокументСписания, Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Коэффициент, Количество");
			ЗаполнитьЗначенияСвойств(ДанныеРазукомплектации, Выборка);
			ДанныеРазукомплектации.Комплектация = Комплектация.Ссылка;
			МассивКомплектов.Добавить(ДанныеРазукомплектации);
			
			//Записшем в регистр зависимых документов
			Запись = РегистрыСведений.ДокументыВозвратТоваров.СоздатьМенеджерЗаписи();
			Запись.ВозвратТовара = Выборка.ВозвратТовара;
			Запись.ЗависимыйДокумент = Комплектация.Ссылка;
			Запись.Записать(Истина);

		КонецЦикла;
		
		//Запись
		Попытка
			ДокументСписания.Комментарий = ДокументСписания.Комментарий + "##Изменен_Из_ОбработкаСписанныхТоваров## - " + Строка(ТекущаяДата());
			Если ДокументСписания.Товары.Количество() = 0 Тогда
				ДокументСписания.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				ДокументСписания.УстановитьПометкуУдаления(Истина);
			Иначе
				ДокументСписания.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение (Нстр("ru = 'Операция создания документов не удалась'; uk = 'Операция создания документов не удалась'"));
		КонецПопытки;
				
	КонецЦикла;  // По документам 
	
	//Документ Реализация товаров.
	Если Не МассивКомплектов.Количество() = 0 Тогда
		РеализацияТоваров = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		РеализацияТоваров.Дата = ТекущаяДата();
		// Заполнить реквизиты значениями по умолчанию.
		ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(РеализацияТоваров, глЗначениеПеременной("глТекущийПользователь"),,,,);
		ОбщегоНазначения.ЗаполнитьОбязательныеРеквизитыШапкиНовогоДокумента(РеализацияТоваров, глЗначениеПеременной("глТекущийПользователь"));
		
		Товары = РеализацияТоваров.Товары;
		Для Каждого СтруктураДанных Из МассивКомплектов Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураДанных,,"ХарактеристикаНоменклатуры");
			НоваяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
		КонецЦикла;
		РеализацияТоваров.Комментарий = "##СозданИз_ОбработкаСписанныхТоваров##"; 
		Попытка
			РеализацияТоваров.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение (Нстр("ru = 'Операция создания документов не удалась. Не удалось создать Реализацию товаров'; uk = 'Операция создания документов не удалась. Не вдалося створити Реалізацію товарів'"));
		КонецПопытки;		
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
	
	Возврат Новый Структура ("РеализацияТоваров, МассивКомплектов", РеализацияТоваров, МассивКомплектов);
	
КонецФункции

#КонецОбласти

#КонецЕсли
